Pandas provides two data structures , series - like arrays and data frame which is two dimenional mutuable hetrogeneous data structure with labeled axes (rows and columns).

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\aanan\appdata\local\programs\python\python39\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\aanan\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\aanan\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\aanan\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\aanan\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 21.2.4; however, version 25.0 is available.
You should consider upgrading via the 'c:\users\aanan\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
# Series is a one D array and that can contain any data typr.
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
# Creating a dictionary from dictionary
series_dict = {'A':1,
               'B':2,
               'C':3,
               'D':4}

my_dict_series = pd.Series(series_dict)
print(my_dict_series)

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
data = [1,2,3,4,5,6]
indices = ['a','b','c','d','e','f']
my_series = pd.Series(data,index=indices)
print(my_series)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [9]:
#Create a dataframe from a dicct
data = {
    'Name': ['Krish','Anand','Mayank'],
    'Age' : [25,63,45],
    'city' : ['ggn','ban','florida']
}
df = pd.DataFrame(data)
print(df)

     Name  Age     city
0   Krish   25      ggn
1   Anand   63      ban
2  Mayank   45  florida

In [10]:
import numpy as np
arr1 = np.array(df)
print(arr1)

[['Krish' 25 'ggn']
 ['Anand' 63 'ban']
 ['Mayank' 45 'florida']]

In [13]:
# Creating dataframe from list of dict
data = [
    {'Name': 'Krish','Age' : 23 ,'city': 'ggn'},
    {'Name': 'Avinash','Age' : 26 ,'city': 'blr'},
    {'Name': 'Mayank','Age' : 45 ,'city': 'florida'},
    {'Name': 'Anand','Age' : 24 ,'city': 'rnc'}
]

In [14]:
df = pd.DataFrame(data)
print(df)

      Name  Age     city
0    Krish   23      ggn
1  Avinash   26      blr
2   Mayank   45  florida
3    Anand   24      rnc

In [16]:
df = pd.read_csv('sales_data.csv')
print(df.head())

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [17]:
df.loc[0][0]

10001

In [18]:
df.iloc[0][1]

'2024-01-01'

In [19]:
# Accessing a specified element
df['Date']

0      2024-01-01
1      2024-01-02
2      2024-01-03
3      2024-01-04
4      2024-01-05
          ...
235    2024-08-23
236    2024-08-24
237    2024-08-25
238    2024-08-26
239    2024-08-27
Name: Date, Length: 240, dtype: object

In [22]:
df.at[1,'Date']

'2024-01-02'

In [25]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [24]:
# Accessing specific elemt from dataframe
df.iat[2,2]

'Clothing'

Data manupalation using pandas

In [26]:
# Creating dataframe from list of dict
data = [
    {'Name': 'Krish','Age' : 23 ,'city': 'ggn'},
    {'Name': 'Avinash','Age' : 26 ,'city': 'blr'},
    {'Name': 'Mayank','Age' : 45 ,'city': 'florida'},
    {'Name': 'Anand','Age' : 24 ,'city': 'rnc'}
]
df= pd.DataFrame(data)

In [27]:
df['Salary'] = [50000,60000,80000,120000]
print(df)

      Name  Age     city  Salary
0    Krish   23      ggn   50000
1  Avinash   26      blr   60000
2   Mayank   45  florida   80000
3    Anand   24      rnc  120000

In [28]:
df.drop('Salary')

KeyError: "['Salary'] not found in axis"

In [29]:
# By default axis is taken as fixed column so to remove 
df.drop('Salary',axis=1) # It is temporary and doesnot take changes actualy
print(df)

      Name  Age     city  Salary
0    Krish   23      ggn   50000
1  Avinash   26      blr   60000
2   Mayank   45  florida   80000
3    Anand   24      rnc  120000

In [30]:
# t0 make its permanently
df.drop('Salary',axis=1,inplace=True) 
print(df)

      Name  Age     city
0    Krish   23      ggn
1  Avinash   26      blr
2   Mayank   45  florida
3    Anand   24      rnc

In [31]:
df['Age'] = df['Age']+1
df

      Name  Age     city
0    Krish   24      ggn
1  Avinash   27      blr
2   Mayank   46  florida
3    Anand   25      rnc

In [32]:
df.drop(0,inplace=True)
df

      Name  Age     city
1  Avinash   27      blr
2   Mayank   46  florida
3    Anand   25      rnc

In [33]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [34]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000